Crazy-Geeks/STM32-ARGB-DMA/Library/ARGB.c
    switch (i % 6) 
    {
// Src: https://stackoverflow.com/questions/3018313
//    uint8_t reg = hue / 43;
//    uint8_t rem = (hue - (reg * 43)) * 6;
//    uint8_t p = (val * (255 - sat)) >> 8;
//    uint8_t q = (val * (255 - ((sat * rem) >> 8))) >> 8;
//    uint8_t t = (val * (255 - ((sat * (255 - rem)) >> 8))) >> 8;
//    switch (reg) {
        case 0: *_r = val, *_g = t, *_b = p; break;
        case 1: *_r = q, *_g = val, *_b = p; break;
        case 2: *_r = p, *_g = val, *_b = t; break;
        case 3: *_r = p, *_g = q, *_b = val; break;
        case 4: *_r = t, *_g = p, *_b = val; break;
        default: *_r = val, *_g = p, *_b = q; break;
    }
}

/**
  * @brief  TIM DMA Delay Pulse callback.
  * @param  dummy param, null ptr
  * @retval None
  */
void argb_tim_dma_delay_pulse(void *param, uint32_t flags) 
{
    (void) param;

    if (buf_counter == 0) return; // if no data to transmit - return
    
    if (flags & STM32_DMA_ISR_HTIF)
    {
        if (!(flags & STM32_DMA_ISR_TCIF))
        {
            dmaStreamClearInterrupt(DMA_HANDLE);
        }

        if (buf_counter < NUM_PIXELS) 
        {
            // fill first part of buffer
            for (volatile uint8_t i = 0; i < 8; i++) 
            {
#if defined(MIXED_RGB_GRB) && defined(RGBW)
                if ((buf_counter >= sk6812_start) && (buf_counter <= sk6812_end))
                {
                    pwm_buf[i] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ?          SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 8] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ?  SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 16] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 24] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0)?  SK6812_PWM_HI : SK6812_PWM_LO;
                }
                else if ((buf_counter >= ws2812_start) && (buf_counter <= ws2812_end))
                {
                    pwm_buf[i] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ?          WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 8] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ?  WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 16] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 24] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0)?  WS2812_PWM_HI : WS2812_PWM_LO;
                }
#elif defined(MIXED_RGB_GRB) && !defined(RGBW)
                if ((buf_counter >= sk6812_start) && (buf_counter <= sk6812_end))
                {
                    pwm_buf[i] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ?          SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 8] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ?  SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 16] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                }
                else if ((buf_counter >= ws2812_start) && (buf_counter <= ws2812_end))
                {
                    pwm_buf[i] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ?          WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 8] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ?  WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 16] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                }
#elif defined(RGBW)
                pwm_buf[i] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 8] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 16] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 24] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0)? PWM_HI : PWM_LO;
#else
                pwm_buf[i] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 8] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 16] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
#endif
            }
            buf_counter++;
        } 
        else if (buf_counter < NUM_PIXELS + 2) // if RET transfer
        {
            memset((dma_siz *) &pwm_buf[0], 0, (PWM_BUF_LEN / 2)*sizeof(dma_siz)); // first part
            buf_counter++;
        }
    }
    if (flags & STM32_DMA_ISR_TCIF)
    {
        // if data transfer
        if (buf_counter < NUM_PIXELS) 
        {
            // fill second part of buffer
            for (volatile uint8_t i = 0; i < 8; i++) 
            {
#if defined(MIXED_RGB_GRB) && defined(RGBW)
                if ((buf_counter >= sk6812_start) && (buf_counter <= sk6812_end))
                {
                    pwm_buf[i + 32] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ?     SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 40] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 48] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 56] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                }
                else if ((buf_counter >= ws2812_start) && (buf_counter <= ws2812_end))
                {
                    pwm_buf[i + 32] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ?     WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 40] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 48] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 56] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                }
#elif defined(MIXED_RGB_GRB) && !defined(RGBW)
                if ((buf_counter >= sk6812_start) && (buf_counter <= sk6812_end))
                {
                    pwm_buf[i + 24] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 32] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ?     SK6812_PWM_HI : SK6812_PWM_LO;
                    pwm_buf[i + 40] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? SK6812_PWM_HI : SK6812_PWM_LO;
                }
                else if ((buf_counter >= ws2812_start) && (buf_counter <= ws2812_end))
                {
                    pwm_buf[i + 24] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 32] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ?     WS2812_PWM_HI : WS2812_PWM_LO;
                    pwm_buf[i + 40] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? WS2812_PWM_HI : WS2812_PWM_LO;
                }
#elif defined(RGBW)
                pwm_buf[i + 32] = (((rgb_buf[4 * buf_counter] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 40] = (((rgb_buf[4 * buf_counter + 1] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 48] = (((rgb_buf[4 * buf_counter + 2] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 56] = (((rgb_buf[4 * buf_counter + 3] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
#else
                pwm_buf[i + 24] = (((rgb_buf[3 * buf_counter] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 32] = (((rgb_buf[3 * buf_counter + 1] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
                pwm_buf[i + 40] = (((rgb_buf[3 * buf_counter + 2] << i) & 0x80) > 0) ? PWM_HI : PWM_LO;
#endif
            }
            buf_counter++;
        } 
        else if (buf_counter < NUM_PIXELS + 2) // if RET transfer
        {
            memset((dma_siz *) &pwm_buf[PWM_BUF_LEN / 2], 0, (PWM_BUF_LEN / 2)*sizeof(dma_siz)); // second part
            buf_counter++;
        } 
        else 
        { // if END of transfer
            buf_counter = 0;

            // STOP DMA
            dmaStreamDisable(DMA_HANDLE);
            
            /* Disable the Peripheral */
            TIM_HANDLE.tim->DIER &= ~STM32_TIM_DIER_CC4DE;
            pwmDisableChannelI(&TIM_HANDLE, TIM_CH);
            TIM_HANDLE.tim->CR1 &= ~STM32_TIM_CR1_CEN;

            argb_lock_state = ARGB_READY;
        }
    }
}

/** @} */ // Private

/** @} */ // Driver

// Check strip type
#if !(defined(SK6812) || defined(WS2811F) || defined(WS2811S) || defined(WS2812))
#error INCORRECT LED TYPE
#warning Set it from list in ARGB.h string 29
#endif

// Check channel
#if !(TIM_CH == TIM_CHANNEL_1 || TIM_CH == TIM_CHANNEL_2 || TIM_CH == TIM_CHANNEL_3 || TIM_CH == TIM_CHANNEL_4)
#error Wrong channel! Fix it in ARGB.h string 40
#warning If you shure, search and set TIM_CHANNEL by yourself
#endif

// Check DMA Size
#if !(defined(DMA_SIZE_BYTE) | defined(DMA_SIZE_HWORD) | defined(DMA_SIZE_WORD))
#error Wrong DMA Size! Fix it in ARGB.h string 42
#endif
